УправлениеПаркомАтракционов/src/Documents/ПосещениеАтракциона/ПосещениеАтракциона.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПосещениеАтракциона</name>
  <registerRecords>AccumulationRegister.АктивныеПосещения</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Атракцион</name>
    <type>
      <types>CatalogRef.Атракционы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПосещения</name>
    <type>
      <types>DocumentRef.ПродажаБилета</types>
    </type>
  </attributes>
</mdclass:Document>

УправлениеПаркомАтракционов/src/AccumulationRegisters/АктивныеПосещения/АктивныеПосещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>АктивныеПосещения</name>
  <resources>
    <name>КоличествоПосещений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОснованиеПосещения</name>
    <type>
      <types>DocumentRef.ПродажаБилета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Атракцион</name>
    <type>
      <types>CatalogRef.Атракционы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УправлениеПаркомАтракционов/src/Documents/ПосещениеАтракциона/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	// регистр АктивныеПосещения
	Движения.АктивныеПосещения.Записывать = Истина;
	Движение = Движения.АктивныеПосещения.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.ОснованиеПосещения = ОснованиеПосещения;
	Движение.Атракцион = Атракцион;
	Движение.КоличествоПосещений = 1;
	
	Движения.Записать();
	Движения.АктивныеПосещения.БлокироватьДляИзменения = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	АктивныеПосещенияОстатки.ОснованиеПосещения
		|ИЗ
		|	РегистрНакопления.АктивныеПосещения.Остатки(, ОснованиеПосещения = &ОснованиеПосещения) КАК АктивныеПосещенияОстатки
		|ГДЕ
		|	АктивныеПосещенияОстатки.КоличествоПосещенийОстаток < 0";
	
	Запрос.УстановитьПараметр("ОснованиеПосещения", ОснованиеПосещения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "По одному билету можно проходить только 1 раз";
		Сообщение.УстановитьДанные("ЭтотОбъект");
		Сообщение.Поле = "Основание";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
